Config.org
#+TITLE: Arkomoacs emacs.d
#+AUTHOR: Scott Astatine
#+PROPERTY:  header-args:emacs-lisp :tangle ~/.emacs.d/init.el :mkdirp yes

* Startup
** early-init.el
#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
;; -*- lexical-binding: t; -*-
(setq gc-cons-threshold (* 50 1024 1024)
      inhibit-startup-message t
      native-compile-prune-cache t
      native-comp-async-report-warnings-errors nil
      visible-bell nil
      user-emacs-directory (expand-file-name "~/.emacs.d/.cache/")
      package-native-compile t
      package-enable-at-startup nil)

(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
(set-fringe-mode 1)
(menu-bar-mode -1)
(column-number-mode)
(global-display-line-numbers-mode t)
(menu-bar--display-line-numbers-mode-relative)
;; Set up the visible bell
(setq visible-bell t)

(global-set-key (kbd "<escape>") 'keyboard-escape-quit)


;; Profile emacs startup
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "*** Emacs loaded in %s seconds with %d garbage collections."
                     (emacs-init-time "%.2f")
                     gcs-done)))

#+end_src

** General Settings
#+begin_src emacs-lisp
(setq scroll-step 1
      scroll-margin 2
      large-file-warning-threshold nil
      pixel-scroll-precision-large-scroll-height 40.0
      url-history-file (expand-file-name "url/history" user-emacs-directory))


(load-file "~/.emacs.d/hide-mode-line.el")

(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(hl-line-mode t)
(set-face-background 'hl-line "#4f4f4f")
(blink-cursor-mode 0)


#+end_src

** Auto Hooks
#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el

(dolist (mode '(term-mode-hook
                helpful-mode-hook
                vterm-mode-hook
                dashboard-mode-hook
                messages-buffer-mode-hook
                ielm-mode-hook
                dictonary-mode-hook
                image-mode-hook
                nov-mode-hook
                ibuffer-mode-hook
                pdf-outline-buffer-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda ()
                   (progn
                     (display-line-numbers-mode 0)
                     (hide-mode-line-mode 1)
                     (undo-tree-mode 0)))))

;;; Pdf Mode hooks
(dolist (mode '(doc-view-mode-hook
                pdf-view-mode-hook))
  (add-hook mode (lambda ()
                   (progn
                     (display-line-numbers-mode 0)
                     (undo-tree-mode 0)))))

#+end_src

** Native Compilation
Directory for storing native comp cache

#+begin_src emacs-lisp
(add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory))
#+end_src

** Fonts Config

#+begin_src emacs-lisp
(defvar spacedefault-font-size 105)
(defvar spacedefault-code-font "JetBrains Mono")

(set-face-attribute 'default nil :font spacedefault-code-font :height spacedefault-font-size)
(set-face-attribute 'fixed-pitch nil :font spacedefault-code-font :height spacedefault-font-size :weight 'regular)

;;; Previous Font "Leckerli One" Princess Sofia
(set-face-attribute 'variable-pitch nil :font "Salsa" :height 165 :weight 'regular)

(variable-pitch-mode t)

(custom-set-variables '(font-lock-support-mode 'tree-sitter-lock-mode))

#+end_src

** Org Mode Font
Font config for different headers in orgmode & more appearence things

#+begin_src emacs-lisp
(defun spaceorg-font-setup ()
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
  (dolist (face '((org-level-1 . 1.3)
                  (org-level-2 . 1.14)
                  (org-level-3 . 1.07)
                  (org-level-4 . 1.04)
                  (org-level-5 . 1.02)
                  (org-level-6 . 1.02)
                  (org-level-7 . 1.02)
                  (org-level-8 . 1.02)))
    (set-face-attribute (car face) nil :font "Salsa" :weight 'regular :height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
  ;; (set-face-attribute 'org-verbatim nil :inherit 'fixed-pitch)
  ;; (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  ;; (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

#+end_src

* Package Manager
** package.el
#+begin_src emacs-lisp  
;; Initialize package sources
;; (require 'package)
;; (eval-and-compile
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))
;; (package-initialize)
;; (unless package-archive-contents
;;   (package-refresh-contents))

;; ;; Initialize use-package on non-Linux platforms
;; (unless (package-installed-p 'use-package)
;;   (package-install 'use-package))

;; (require 'use-package)
;; (setq use-package-always-ensure t))

#+end_src

** =straight.el= and =use-package.el=
Package installation:
- =:straight= to specify recipes for custom or local packages
Package loading:
- =:disabled= for disabled packages (e.g. unused themes)
- =:if=, =:when=, and =:unless= for conditionally loading/configuring the package
- =:after= when it only makes sense to load one package after another (not used for "core" packages like =evil= that are loaded immediately) (usually not necessary)
- =:demand t= for packages that should be loaded immediately (e.g. =evil=)
- =:defer number= for packages whose functionality should be quickly available but is not necessary immediately (use sparingly)
- =:defer-incrementally= for packages with lots of dependencies (functionality from doom)
- =:ghook= to add to hooks that will later run and load the package
- =:mode= as a temporary solution for major modes that don't add to =auto-mode-alist=
- =:commands= as a temporary solution for packages that don't have autoload cookies
- =:general= for any keybindings meant to load the package (and not others; I use this keyword only to make it very clear how the package will be loaded)
- =:init= for any settings that need to be set before loading the package (e.g. =evil-want-keybinding=) and for function calls meant to load the package (e.g. enabling a global minor mode, setting another package's variable to a function from this package, etc.)

Note that using =:after= will put the rest of the non-installation configuration in an ~eval-after-load~ (including the =:init= section, the =(require package)= statement generated from =:demand t=, etc.). Also note that by default only =:init= can fail if the package isn't successfully installed (see ~use-package-check-before-init~); specifying =:demand=, for example, will cause an error if the package fails to install.

As a workaround, I'm setting a default value for =:when= in ~use-package-defaults~ (that is used even when =:when= is explicitly specified) to prevent package configuration if package installation fails. See [[https://github.com/jwiegley/use-package/issues/693][issue 693]] and [[https://github.com/jwiegley/use-package/issues/739][issue 739]].

Package configuration:
- =:blackout= (or =:diminish= or =:delight=) for diminishing minor mode names
- =:gfhook= for any setup configuration for a mode (e.g. set local variables or enable/disable minor modes)
- =:config= for any basic package setup; more complicated setup should go in specific subheadings

In the =:config= section, I generally put settings (~setq~ then any face configuration then ~add-hook~), then keybindings, then enabling any modes, and then any other configuration.
*** Straight
Install, load, and configure =straight.el=:
#+begin_src emacs-lisp
(setq straight-repository-branch "develop"
      straight-enable-use-package-integration t
      straight-check-for-modifications '(check-on-save find-when-checking)
      straight-use-package-by-default t
      straight-cache-autoloads t
      straight-host-usernames '((github . "scott-astatine")
                                (gitlab . "scott-astatine")))

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el"
                         user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  ;; (benchmark 1 `(load ,bootstrap-file nil 'nomessage))
  (load bootstrap-file nil 'nomessage))
#+end_src

*** Use-package
Install =use-package.el= with optional dependencies and configure:
#+begin_src emacs-lisp
(straight-use-package 'use-package)

(eval-when-compile
  (require 'use-package)
  (setq use-package-always-defer t))

;; demote installation errors to messages
;; this variable is no longer changed by straight
;; (advice-add use-package-ensure-function :around #'noct-use-package-ensure)
(when (bound-and-true-p noct-with-demoted-errors)
  (advice-add 'straight-use-package :around #'noct-inhibit-error-advice))
;; can test with something like this:
;; (use-package does-not-exist)

(use-package blackout
  :straight (blackout :host github :repo "raxod502/blackout")
  :demand t)
#+end_src

** .emacs.d Management

#+begin_src emacs-lisp

(use-package no-littering
  :ensure t)

(setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

#+end_src

* Functions Lib
** Toogle Transparency
#+begin_src emacs-lisp
(set-frame-parameter nil 'alpha '(100 . 100))
;; (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
;; (add-to-list 'default-frame-alist '(fullscreen . maximized))

(defun toggle-transparency ()
  (interactive)
  (let ((alpha (frame-parameter nil 'alpha)))
    (set-frame-parameter
     nil 'alpha
     (if (eql (cond ((numberp alpha) alpha)
                    ((numberp (cdr alpha)) (cdr alpha))
                    ;; Also handle undocumented (<active> <inactive>) form.
                    ((numberp (cadr alpha)) (cadr alpha)))
              100)
         '(80 . 50) '(100 . 100)))))
(toggle-transparency)
#+end_src

** Window Related Funcs
#+begin_src emacs-lisp
(set-fringe-style 1)
(setq window-divider-default-right-width 2)

(defun set-window-height (height)
  "Set the height of the current window to the specified HEIGHT."
  (interactive "nWindow height: ")
  (if (> height (window-total-height))
      (enlarge-window (- height (window-total-height)))
    (shrink-window (- (window-total-height) height))))

(defun set-window-width (width)
  "Set the width of the current window to WIDTH."
  (interactive "nNew window width: ")
   (if (> width (window-width))
      (enlarge-window-horizontally (- width (window-width)))
    (shrink-window-horizontally (- (window-width) width))))


(defun split-window-below-with-height (height)
  "Split the current window horizontally and switch to the new window.
     The new window will be given the specified HEIGHT."
  (interactive "nWindow height: ")
  (split-window-below)
  (windmove-down)
  (set-window-height height))

(defun split-repl ()
  (interactive)
  (split-window-below-with-height 15)
  (ielm)
  (setq splitwin (selected-window))
  (add-hook 'kill-buffer-hook
            (lambda ()
              (when (eq splitwin (selected-window))
                (delete-window (selected-window))))))

(defun quit-window-and-kill ()
  (interactive)
  (let ((win (selected-window)))
    (evil-window-prev 2)
    (quit-window t win)))
#+end_src

** Vterm Popup
#+begin_src emacs-lisp
(defun split-vterm (height)
  "Split vterm"
  (interactive "nWindow height: ")
  (split-window-below-with-height height)
  (multi-vterm)
  (setq splitwin (selected-window))
  (add-hook 'kill-buffer-hook
            (lambda ()
              (when (eq splitwin (selected-window))
                (delete-window splitwin)))))
;;(general-def 'normal 'vterm-mode-map
;;  "C-c" 'vterm--self-insert
;;  "C-d" 'kill-this-buffer)

(defun split-h-vterm-window ()
  (interactive)
  (split-vterm 10)
  (hide-mode-line-mode))

#+end_src

** Project runner
#+begin_src emacs-lisp
(defvar project-run-cmds
  '((cargo . "cargo run")
    (npm . "npm start")
    (python . "python main.py")
    (pnpm . "pnpm run")
    (make . "make")))

;; Define a map that contains the package manager/build system config file names
(defvar project-config-files
  '((cargo . "Cargo.toml")
    (npm . "package.json")
    (python . "main.py")
    (pnpm . "pnpm-lock.json")
    (make . "Makefile")))

(defun run-current-project ()
  "Run the current project"
  (interactive)
  (let ((project-root default-directory)
        (runconf-file (locate-dominating-file default-directory ".runconf"))
        (run-command nil))
    (if runconf-file
        (with-temp-buffer
          (insert-file-contents (concat runconf-file ".runconf"))
          (setq run-command (buffer-string))))

    (if (not run-command)
        (let ((config-file nil))
          (dolist (file-map project-config-files)
            (progn
              (setq config-file-name (cdr file-map))
              (when (locate-dominating-file project-root config-file-name)
                (setq run-command (cdr (assq (car (rassoc config-file-name project-config-files)) project-run-cmds)))
                (write-region run-command nil (concat project-root ".runconf")))))))
    
    (if (and (not run-command) (not runconf-file))
        (write-region "" nil (concat project-root ".runconf")))
    
    (when run-command
      (save-buffer)
      (split-window-below-with-height 14)
      (if (get-buffer "Runner")
          (kill-buffer "Runner"))

      (term (concat "cd " project-root " && " run-command "\n"))
      (general-def
       :keymaps 'local
       :states '(normal insert)
       "C-c" 'vterm--self-insert
       "C-d" '(lambda () (interactive) (kill-this-buffer))
       "q" '(lambda () (interactive) (kill-this-buffer)))
      ;; (vterm-send-string (concat "cd " project-root " && " run-command "\n"))
      ;; (set-frame-name "project-runner")
      (setq splitwin (selected-window))
      (rename-buffer "Runner")
      (add-hook 'kill-buffer-hook
                (lambda ()
                  (when (eq splitwin (selected-window))
                    (delete-window splitwin))))
      (windmove-up)
      )))

#+end_src

** Buffer Hooks
#+begin_src emacs-lisp

#+end_src

